// Необходимо создать переменную в которой будет храниться температура в градусах Цельсия, преобразовать значение в температуру по фаренгейту.
// Формула перевода градусов Цельсия в градусы Фаренгейта: градусы Фаренгейта = (9 / 5) * градусы Цельсия + 32
// Вывести в консоль температуру в Цельсиях и Фаренгейтах.

let c = 22,
    f = (9/5) * c + 32;
console.log(`Градусы в Цельсиях = ${c} 
Градусы в Фаренгейтах - ${f}`);

// Необходимо создать переменную name, записать в эту переменную свое имя. Необходимо также создать переменную admin и присвоить этой переменной значение из переменной name. Вывести значение переменной admin в консоль.

const name = "Tatyana";
const admin = name;
console.log(admin);
// Урок 2.
// Задание 1
// Создать переменные num1, num2 которые пользователь вводит с клавиатуры
// Проверьте, что переменная num1 равна или меньше 1, а переменная num2 больше или равна 3.

const num1 = -1;
const num2 = 2;

console.log(num1 <= 1, num2 >= 3);

// Задание 2
// Перепишите код к тернарному оператору

// let test = true;
// if (test === true) {
// console.log('+++');
// } else {
// console.log('---');
// }

let test = false;
console.log((test === true) ? '+++' : '---');

// Задание 3
// В переменной day лежит какое-то число из интервала от 1 до 31. 
// Определите в какую декаду месяца попадает это число (в первую, вторую или третью).

let day = Math.ceil (Math.random() * 31);
if (day<11) {
    console.log(`Число ${day} попадает в первую декаду месяца`)
} 
else if (day>11 && day<21) {
    console.log(`Число ${day} попадает во вторую декаду месяца`)
}
else {
    console.log(`Число ${day} попадает в третью декаду месяца`)
}

// Задание 4
// (Для решения задания вам потребуется оператор остаток от деления %, например 10%3 === 1 , 
// десять разделить на 3, остаток 1, второй пример 7 % 5, тут остаток от деления будет 2, 
// ну и 3 пример это 14 % 10 === 4, остаток от деления на 10 будет равен 4)
// Необходимо от пользователя получить число.
// Необходимо вывести разряды числа, а именно: количество сотен, десятков и единиц.
// Пример:
// Пользователь ввел число 163. Программа должна вывести:
// "В числе 163 количество сотен: 1, десятков: 6, единиц: 3"
// Уточнение: пользователь всегда вводит корректное положительное целое число.

let num = 78;
tens = Math.floor (num / 10 % 10);
hundreds = Math.floor(num / 100 % 10);
console.log(`В числе ${num} количество сотен: ${hundreds}, десятков: ${tens}, единиц: ${num % 10}`);

// Урок 3.
// Задание 1
// Создайте функцию которая возводит переданное число в куб, 
// необходимо вывести в консоль результат 2^3 степени + 3 ^ 3 степени

function pow (num) {
    return Math.pow (num, 3)
} 
console.log (pow (2) + pow(3))

// Задание 2
// Пользователь вводит с клавиатуры число, если ввёл текст, необходимо вывести что значение задано неверно
// Создать фукнцию, которая высчитывает 13% от 
// данного числа и выводит в консоль текст "Размер заработной платы за вычетом налогов равен значение"

let n = prompt();
if (Number.isNaN(Number(n)))
n = prompt('Введите число');

function result (n) {
return n - n / 100 * 13;
}
console.log (`Размер заработной платы за вычетом налогов равен ${result(n)}`)

// Задание 3
// Пользователь с клавиатуры вводит 3 числа, необходимо создать функцию, 
// которая определяет максимальное значение среди этих чисел

let a = prompt ();
let b = prompt ();
let c = prompt ();
function maxNum(a, b, c) {
    return Math.max(a, b, c);
  }
console.log (`Максимальное значение ${maxNum (a, b, c)}`); //или alert(`Максимальное значение ${maxNum (a, b, c)}`)

// Задание 4
// Необходимо реализовать четыре функции, каждая функция должна принимать по два числа и 
// выполнять одну из операций (каждая функция выполняет одну из них):
// 1. Сложение
// 2. Разность
// 3. Умножение
// 4. Деление
// Необходимо сделать так, чтобы функция вернула число, например выражение 
// console.log(sum(2, 6)); должно вывести число 8 в консоль (sum - функция 
//     сложения в данном примере, ваши названия функций могут отличаться). 
//     Округлять значения, которые возвращают функции не нужно, однако, 
//     обратите внимание на разность, функция должна вычесть из большего числа меньшее, 
//     либо вернуть 0, если числа равны. Функциям всегда передаются корректные числа, 
//     проверки на NaN, Infinity делать не нужно.


function sum(a, b) {
    return a + b;
}
console.log (`Сложение - ${sum(2, 6)}`);

function sub (a, b) {
    return a - b;
}
console.log (`Разность - ${sub (6, 2)}`);

function mult (a, b) {
    return a * b;
}
console.log (`Умножение - ${mult(2, 6)}`);

function div (a, b) {
    return a / b;
}
console.log (`Деление - ${div(6, 2)}`);