// Необходимо создать переменную в которой будет храниться температура в градусах Цельсия, преобразовать значение в температуру по фаренгейту.
// Формула перевода градусов Цельсия в градусы Фаренгейта: градусы Фаренгейта = (9 / 5) * градусы Цельсия + 32
// Вывести в консоль температуру в Цельсиях и Фаренгейтах.

let c = 22,
    f = (9/5) * c + 32;
console.log(`Градусы в Цельсиях = ${c} 
Градусы в Фаренгейтах - ${f}`);

// Необходимо создать переменную name, записать в эту переменную свое имя. Необходимо также создать переменную admin и присвоить этой переменной значение из переменной name. Вывести значение переменной admin в консоль.

const name = "Tatyana";
const admin = name;
console.log(admin);
// Урок 2.
// Задание 1
// Создать переменные num1, num2 которые пользователь вводит с клавиатуры
// Проверьте, что переменная num1 равна или меньше 1, а переменная num2 больше или равна 3.

const num1 = -1;
const num2 = 2;

console.log(num1 <= 1, num2 >= 3);

// Задание 2
// Перепишите код к тернарному оператору

// let test = true;
// if (test === true) {
// console.log('+++');
// } else {
// console.log('---');
// }

let test = false;
console.log((test === true) ? '+++' : '---');

// Задание 3
// В переменной day лежит какое-то число из интервала от 1 до 31. 
// Определите в какую декаду месяца попадает это число (в первую, вторую или третью).

let day = Math.ceil (Math.random() * 31);
if (day<11) {
    console.log(`Число ${day} попадает в первую декаду месяца`)
} 
else if (day>11 && day<21) {
    console.log(`Число ${day} попадает во вторую декаду месяца`)
}
else {
    console.log(`Число ${day} попадает в третью декаду месяца`)
}

// Задание 4
// (Для решения задания вам потребуется оператор остаток от деления %, например 10%3 === 1 , 
// десять разделить на 3, остаток 1, второй пример 7 % 5, тут остаток от деления будет 2, 
// ну и 3 пример это 14 % 10 === 4, остаток от деления на 10 будет равен 4)
// Необходимо от пользователя получить число.
// Необходимо вывести разряды числа, а именно: количество сотен, десятков и единиц.
// Пример:
// Пользователь ввел число 163. Программа должна вывести:
// "В числе 163 количество сотен: 1, десятков: 6, единиц: 3"
// Уточнение: пользователь всегда вводит корректное положительное целое число.

let num = 78;
tens = Math.floor (num / 10 % 10);
hundreds = Math.floor(num / 100 % 10);
console.log(`В числе ${num} количество сотен: ${hundreds}, десятков: ${tens}, единиц: ${num % 10}`);

// Урок 3.
// Задание 1
// Создайте функцию которая возводит переданное число в куб, 
// необходимо вывести в консоль результат 2^3 степени + 3 ^ 3 степени

function pow (num) {
    return Math.pow (num, 3)
} 
console.log (pow (2) + pow(3))

// Задание 2
// Пользователь вводит с клавиатуры число, если ввёл текст, необходимо вывести что значение задано неверно
// Создать фукнцию, которая высчитывает 13% от 
// данного числа и выводит в консоль текст "Размер заработной платы за вычетом налогов равен значение"

let n = prompt();
if (Number.isNaN(Number(n)))
n = prompt('Введите число');

function result (n) {
return n - n / 100 * 13;
}
console.log (`Размер заработной платы за вычетом налогов равен ${result(n)}`)

// Задание 3
// Пользователь с клавиатуры вводит 3 числа, необходимо создать функцию, 
// которая определяет максимальное значение среди этих чисел

let a = prompt ();
let b = prompt ();
let c = prompt ();
function maxNum(a, b, c) {
    return Math.max(a, b, c);
  }
console.log (`Максимальное значение ${maxNum (a, b, c)}`); //или alert(`Максимальное значение ${maxNum (a, b, c)}`)

// Задание 4
// Необходимо реализовать четыре функции, каждая функция должна принимать по два числа и 
// выполнять одну из операций (каждая функция выполняет одну из них):
// 1. Сложение
// 2. Разность
// 3. Умножение
// 4. Деление
// Необходимо сделать так, чтобы функция вернула число, например выражение 
// console.log(sum(2, 6)); должно вывести число 8 в консоль (sum - функция 
//     сложения в данном примере, ваши названия функций могут отличаться). 
//     Округлять значения, которые возвращают функции не нужно, однако, 
//     обратите внимание на разность, функция должна вычесть из большего числа меньшее, 
//     либо вернуть 0, если числа равны. Функциям всегда передаются корректные числа, 
//     проверки на NaN, Infinity делать не нужно.


function sum(a, b) {
    return a + b;
}
console.log (`Сложение - ${sum(2, 6)}`);

function sub (a, b) {
    return a - b;
}
console.log (`Разность - ${sub (6, 2)}`);

function mult (a, b) {
    return a * b;
}
console.log (`Умножение - ${mult(2, 6)}`);

function div (a, b) {
    return a / b;
}
console.log (`Деление - ${div(6, 2)}`);

// Урок 4.
// Задание 1
// Необходимо с помощью цикла for вывести следующие 11 строк в консоль:
// 0 – это ноль
// 1 – нечетное число
// 2 – четное число
// 3 – нечетное число
// …
// 10 – четное число

let arr = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
for (let index = 0; index < arr.length; index++) {
  if (index === 0) {
    console.log (`${index} - это ноль`)
  } 
  else if (index % 2 === 0) {
    console.log (`${index} - это четное число`)
}
  else {
    console.log (`${index} - это нечетное число`)
  }
    
}

// Задание 2
// Дан массив [1, 2, 3, 4, 5, 6, 7]
// Сделайте из этого массива следующий [1, 2, 3, 6, 7]
const arr = [1, 2, 3, 4, 5, 6, 7];
arr.splice (3,2);
console.log(arr);


// Задание 3
// Используя Math.random() вам необходимо генерировать цифры от 0 до 9, и создать массив состоящий из 5 таких элементов
// 1. Рассчитать сумму элементов этого массива
// 2. Найти минимальное число
// 3. Найти есть ли в этом массиве число 3
const length = 5;
const min = 0;
const max = 9;
const numbers = [...Array(length)]; 
for (let i = 0; i < numbers.length; i += 1) { 
    numbers[i] = Math.round(Math.random() * max); 
  }

  const sum = numbers.reduce (function (x, y) {
    return x + y;
  }, 0);

  const minnum = numbers => numbers.reduce ((x,y) => Math.min (x, y));

  const elem = 3;
  function contains (elem){
    if (numbers.filter(i => (i === elem)).length) {
        return true;
    } else {
        return false;
    }
  }

console.log(`Массив ${numbers}`); 
console.log(`Сумма элементов массива - ${sum}`)
console.log (`Минимальное число в массиве - ${minnum(numbers)}`)
console.log ((contains (elem) === true) ? 'Число 3 есть в массиве' : 'Числа 3 нет в массиве')


// *Необязательное задание. *
// Необходимо вывести горку в консоль (используя цикл for), как показано на рисунке, только у вашей горки должно быть 20 рядов, а не 5:
// x
// xx
// xxx
// xxxx
// xxxxx
for(let x = 0; x < 20; x++){
    let str = "";
    for(let y = 0; y <= x; y++){
    str += "x";
    }
    console.log(str);
    }

//     Урок 5.
//     Задание 1
// Дан объект numbers. Необходимо в консоль вывести все значения больше или равные 3.

const numbers = {
  keyin1: 1,
  keyin2: 2,
  keyin3: 3,
  keyin4: 4,
  keyin5: 5,
  keyin6: 6,
  keyin7: 7,
  }
  for (const key in numbers) {
    if (numbers[key]>=3){
    console.log(numbers[key]);    
  }
}

// Задание 2
// Необходимо из объекта, который лежит в константе post вывести значения, к которым приписан комментарий, в консоль.
const post = {
  author: "John", // вывести этот текст
  postId: 23,
  comments: [
  {
  userId: 10,
  userName: "Alex",
  text: "lorem ipsum",
  rating: {
  likes: 10,
  dislikes: 2, // вывести это число
  },
  },
  {
  userId: 5, // вывести это число
  userName: "Jane",
  text: "lorem ipsum 2", // вывести этот текст
  rating: {
  likes: 3,
  dislikes: 1,
  },
  },
  ],
  };

  console.log(post.author);
  console.log(post.comments[0].rating.dislikes);
  console.log(post.comments[1].userId);
  console.log(post.comments[1].text);

//   Задание 3
// Дан массив products, необходимо цену каждого продукта уменьшить на 15% используя метод forEach.
const products = [
  {
  id: 3,
  price: 200,
  },
  {
  id: 4,
  price: 900,
  },
  {
  id: 1,
  price: 1000,
  },
  ];

  products.forEach((product) => {
       product.price *= 0.85;
     });
   console.log(products);
  

  //  Задание 4
  //  1. Необходимо вывести в консоль массив продуктов в котором есть хоть
  //   одна фотография используя метод filter. Исходные данные - массив products.
  

  const products = [
    {
    id: 3,
    price: 127,
    photos: [
    "1.jpg",
    "2.jpg",
    ],
    },
    {
    id: 5,
    price: 499,
    photos: [],
    },
    {
    id: 10,
    price: 26,
    photos: [
    "3.jpg",
    ],
    },
    {
    id: 8,
    price: 78,
    },
    ];

   const newproducts =  products.filter(products => {
    if (products.photos > [])
    return true
   });
    console.log(newproducts);

    //  2. Необходимо отсортировать массив products используя метод sort по цене, начиная
  //   с самой маленькой, заканчивая самой большой ценой, после чего вывести отсортированный массив в консоль.

    products.sort(function (a, b) {
      return a.price - b.price;
    })
    console.log(products);

//     **Задание 5**
// Дано 2 массива 
// Вам необходимо объединить 2 этих массива, чтобы значения первого массива были ключами,
//  а значения второго массива — значениями.

const en = ["mon", "tue", "wed", "thu", "fri", "sat", "sun"];
const ru = ["понедельник", "вторник", "среда", "четверг", "пятница", "суббота", "воскресенье"];

// const newObject = en.reduce(function(obj, key, index) {
//   obj[key] = ru[index];
//   return obj;
// }, {});
// console.log(newObject);

const newObject = {};
en.forEach((key, i) => newObject[key] = ru[i]);
console.log(newObject);