// Необходимо создать переменную в которой будет храниться температура в градусах Цельсия, преобразовать значение в температуру по фаренгейту.
// Формула перевода градусов Цельсия в градусы Фаренгейта: градусы Фаренгейта = (9 / 5) * градусы Цельсия + 32
// Вывести в консоль температуру в Цельсиях и Фаренгейтах.

let c = 22,
    f = (9/5) * c + 32;
console.log(`Градусы в Цельсиях = ${c} 
Градусы в Фаренгейтах - ${f}`);

// Необходимо создать переменную name, записать в эту переменную свое имя. Необходимо также создать переменную admin и присвоить этой переменной значение из переменной name. Вывести значение переменной admin в консоль.

const name = "Tatyana";
const admin = name;
console.log(admin);

// Задание 1
// Создать переменные num1, num2 которые пользователь вводит с клавиатуры
// Проверьте, что переменная num1 равна или меньше 1, а переменная num2 больше или равна 3.

const num1 = -1;
const num2 = 2;

console.log(num1 <= 1, num2 >= 3);

// Задание 2
// Перепишите код к тернарному оператору

// let test = true;
// if (test === true) {
// console.log('+++');
// } else {
// console.log('---');
// }

let test = false;
console.log((test === true) ? '+++' : '---');

// Задание 3
// В переменной day лежит какое-то число из интервала от 1 до 31. 
// Определите в какую декаду месяца попадает это число (в первую, вторую или третью).

let day = Math.ceil (Math.random() * 31);
if (day<11) {
    console.log(`Число ${day} попадает в первую декаду месяца`)
} 
else if (day>11 && day<21) {
    console.log(`Число ${day} попадает во вторую декаду месяца`)
}
else {
    console.log(`Число ${day} попадает в третью декаду месяца`)
}

// Задание 4
// (Для решения задания вам потребуется оператор остаток от деления %, например 10%3 === 1 , 
// десять разделить на 3, остаток 1, второй пример 7 % 5, тут остаток от деления будет 2, 
// ну и 3 пример это 14 % 10 === 4, остаток от деления на 10 будет равен 4)
// Необходимо от пользователя получить число.
// Необходимо вывести разряды числа, а именно: количество сотен, десятков и единиц.
// Пример:
// Пользователь ввел число 163. Программа должна вывести:
// "В числе 163 количество сотен: 1, десятков: 6, единиц: 3"
// Уточнение: пользователь всегда вводит корректное положительное целое число.

let num = 78;
tens = Math.floor (num / 10 % 10);
hundreds = Math.floor(num / 100 % 10);
console.log(`В числе ${num} количество сотен: ${hundreds}, десятков: ${tens}, единиц: ${num % 10}`);


